In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
dic = {'city' : ['서울','부산','대전','대구','광주'],
      'year' : [2017,2017,2018,2018,2018],
      'temp' : [18,20,19,21,20]}
data = pd.DataFrame(dic) ; data

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [4]:
data.index=['a','b','c','d','e'] ;data

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2018    19
d   대구  2018    21
e   광주  2018    20

In [5]:
data.columns = ['도시','연도','날씨'];data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [6]:
data.도시

a    서울
b    부산
c    대전
d    대구
e    광주
Name: 도시, dtype: object

In [7]:
data['도시']

a    서울
b    부산
c    대전
d    대구
e    광주
Name: 도시, dtype: object

In [8]:
data.loc['a']

도시      서울
연도    2017
날씨      18
Name: a, dtype: object

In [9]:
data.set_index(['도시'])

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [10]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [11]:
data = data.set_index(['도시']) ; data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [12]:
data.set_index(['도시',inplace=True]);data

SyntaxError: invalid syntax (<ipython-input-12-277d0be85d27>, line 1)

In [13]:
data.loc['서울']

연도    2017
날씨      18
Name: 서울, dtype: int64

In [14]:
data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [15]:
data.날씨

도시
서울    18
부산    20
대전    19
대구    21
광주    20
Name: 날씨, dtype: int64

In [16]:
data.iloc[1:3]

      연도  날씨
도시
부산  2017  20
대전  2018  19

In [18]:
cars=[50,40,20,30,10]
data['car'] = cars ; data

      연도  날씨  car
도시
서울  2017  18   50
부산  2017  20   40
대전  2018  19   20
대구  2018  21   30
광주  2018  20   10

In [19]:
data['high'] =  data.car >=30
data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

In [20]:
data.drop('car',1)

      연도  날씨   high
도시
서울  2017  18   True
부산  2017  20   True
대전  2018  19  False
대구  2018  21   True
광주  2018  20  False

In [21]:
data.drop(['car','high'],1)

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [22]:
data.drop('광주',0)

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True

In [23]:
data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

In [24]:
dic = {'서울' : 800 , '부산' : 150 , '대구' : 100}
dic

{'서울': 800, '부산': 150, '대구': 100}

In [25]:
s = pd.Series(dic) ;s

서울    800
부산    150
대구    100
dtype: int64

In [27]:
region = pd.Series(['서울','부산','대전','대구','광주'],
                   index=['a','b','c','d','e'])
region

a    서울
b    부산
c    대전
d    대구
e    광주
dtype: object